backend/app/models/order.rb

  def items_with_quantities
    self.order_items.includes(:item).map do |order_item|
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?)  [["id", 5], ["id", 3]]
SELECT "order_items".* FROM "order_items" WHERE "order_items"."order_id" = ?  [["order_id", 1]]

  def compute_total
    self.total = order_items.includes(:item).sum { |oi| oi.item.price * oi.quantity }
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?)  [["id", 5], ["id", 3]]