backend/app/controllers/api/orders_controller.rb

    def index
      orders = Order.includes(order_items: :item).all
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?, ?, ?, ?)  [["id", 5], ["id", 3], ["id", 1], ["id", 4], ["id", 2]]
SELECT "orders".* FROM "orders"

    def show
      order = Order.includes(order_items: :item).find(params[:id])
---
SELECT "items".* FROM "items" WHERE "items"."id" IN (?, ?)  [["id", 1], ["id", 2]]
SELECT "orders".* FROM "orders" WHERE "orders"."id" = ? LIMIT ?  [["id", 2], ["LIMIT", 1]]