backend/app/controllers/api/pizzas_controller.rb

    def index
      pizzas = Pizza.includes(:ingredients).all
---
SELECT "ingredients".* FROM "ingredients" WHERE "ingredients"."id" IN (?, ?, ?, ?, ?, ?, ?)  [["id", 1], ["id", 2], ["id", 3], ["id", 4], ["id", 5], ["id", 6], ["id", 7]]
SELECT "pizzas".* FROM "pizzas"